// Типы операторов: 
// ____________________________в зависимости от количества операндов
//Унарные +, ! 


//Бинарные =, >, <, >=, <=, ==, ===, !=, !==, +, -, *, /, **   




//Тернарные



// ___________________________функциональность


// Преобразования +

// Арифметические +, -, *, / , **  - число

// Логические - >, <, >=, <=, ==, ===, !=, !== - логический

// Перечисление ,


// ____________________________Пример

// Объявление
var a;
var b;

// Инициализация - присвоение значения

a = 'Hello';
b = 3;

var c,d,e;

c = true;

// 
var f = 2,
	g = 5,
	h = 8;


// Приоритет - порядок выполнения
var fg_sum = f+g;
var discount = fg_sum*h; 
console.log(fg_sum);
console.log(discount);

// 
var var1,var2,var3;

